package function;

public class Baekjoon4673 {

	public static void main(String[] args) {
		/*
		양의 정수 n에 대해서 d(n)을 n과 n의 각 자리수를 더하는 함수
		예를 들어, d(75) = 75 + 7 + 5 = 87 이다.
		
		양의 정수n이 주어졌을 때, 이 수를 시작해서 n, d(n), d(d(n)), .. 과 같은 무한수열을 만들 수있다.
		33으로  시작한다면 
		1. 33 + 3 + 3 = 39
		2. 39 + 3 + 9 = 51
		3. 51 + 5 + 1 = 57 이며 이것으로 수열을 만들 수 있다.
		
		n을 d(n)의 생성자라 한다.
		위의 수열에서 33은 39의 생성자 39는 51의 생성자 51은 57의 생성자이다.
		생성자가 한 개보다 많은 경우도 있다. 예를 들어, 101은 생성자가 2개(91과 100)있다.
		
		생성자가 없는 숫자를 셀프 넘버라고 한다. 100보다 작은 셀프 넘버는 총 13개가 있다.
		1, 3, 5, 7, 9, 20, 31, 42, 53, 64, 75, 86, 97
		
		10000보다 작거나 같은 셀프 넘버를 한 줄에 하나씩 출력하는 프로그램을 작성해라.
		
		 */

	}

}
